Дошкольное_учреждение83/src/Catalogs/удуАвторы/удуАвторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуАвторы</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициалы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Catalogs/удуАвторы/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(СокрЛП(Объект.Имя)) Тогда
		Объект.Инициалы = Лев(Объект.Имя,1) + ".";
		Объект.Наименование = Объект.Наименование + Лев(Объект.Имя,1) + ". "; 
	КонецЕсли;
	Если ЗначениеЗаполнено(СокрЛП(Объект.Отчество)) Тогда
		Объект.Инициалы = Объект.Инициалы + " " + Лев(Объект.Отчество,1) + ".";
		Объект.Наименование = Объект.Наименование + Лев(Объект.Отчество,1) + ". "; 
	КонецЕсли;
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + Объект.Инициалы;
КонецПроцедуры
